 #-*- coding: utf-8 -*-

vtuber_origin = { 
    "키즈나 아이":["키즈나 아이","키즈나아이","기즈나","야붕이","야붕","오야붕","1붕","2붕","3붕","4붕","중붕","짱붕"],# 키즈나 아이 코퍼레이션?
    "오메가 시스터즈":["오메시스","리오"], # up8
    "모치 히요코":["히요코"],
    "카시코 마리":["짱마리"], # up8 뮤직 
    "유니":["유니","YuNi"],
    "히비키 아오":["아오","히비키"],
    "AZKi":["아즈키","AZKi"],
    "코코츠키":["코코츠키"],
    "이나바 하네루":["하네루","네루","근혜루","이나바","네루네루태풍","네루네루 태풍"], # 아니마레, 허니스토
    "히노쿠마 란타로":["란","란타로"],
    "소우야 이치카":["이치카"],
    "유노하라 이즈미":["이즈미"],
    "히라 히카리":["히카리"],
    "카제미 쿠쿠":["쿠쿠"],
    "시로미야 미미":["미미","개좆미","개좆미미","좆미","대황미미","대황미"],
    "나나시":["나나시"],
    "스오우 파토라":["파트라","파토라"],
    "세키시로 미코":["세키시로","공포의 군주","공군"],
    "미라이 아카리":["미라이","아카리"], # 엔텀
    "네코미야 히나타":["네코미야","히나타","사기고양이"],
    "우카":["우카"],
    "시로":["시로","파잉"],
    "피망군":["피망군"],
    "바아차루":["바아차루","버차루"], # 앱랜드
    "치에리":["치에리"],
    "메메메":["메메메"],
    "이로하":["이로하","콩고"],
    "후타바":["후타바"],
    "피노":["피노"],
    "스즈":["스즈"],
    "나토리":["나토리"],
    "이오리":["이오리"], # 앱랜드 아이돌부
    "메리":["메리","밀크"], # 앱랜드 기타
    "히메히나":["히메히나","히메","히나"], # 히메히나
    "유게":["유게"],
    "얌미":["얌미"],
    "챠로":["챠로"],
    "유이":["유이"], # 브이게이밍
    "게임부":["게임부","겜부"],
    "하루토":["하루토"], 
    "부장":["유메사키","부장","카에데"],
    "미리아":["미리아"],
    "료":["료"],
    "코코아":["코코아"], # 게임부
    "에이렌":["에이렌","에일렌"],
    "요메미":["요메미"],
    "모에미":["모에미"],
    "에네":["에네"],
    "베일렌":["베일렌"], # 에일렌가
    "케모노즈":["kmnz","케모노즈"],
    "리타":["대리한타", "리타","대한리타"],
    "리즈":["리즈"], # KMNZ
    "카구야":["카구야루나","쭀"],
    "핑키":["핑키","햇반","햇번"], # 문 스튜디오
    "파리프로":["파리프로", "파리마마"],
    "메아":["메아"], # 구 파리프로
    "페르미":["페르미"], # 진공관
    "하노":[], # 리액트
    "레이리":["가능좌","레이리"],
    "리본":["리본"],
    "피카미":["피카미","끠까미","끠카미"], # GYARI
    "야시키 시엘":["시엘","프랑스","프랑스 이모","프랑스이모","프랑스누나","프랑스 누나"],# 브이센
    "뉴뉴":["뉴뉴"],
    "아즈마 림":["아즈림","아즈마","리무","드럼통"],
    "아사노 루리":["루리"],
    "루키로키":["루키로키"],
    "테마리":["테마리","키갤 조카","조카"], # MaHOROBA
    "시라유리 릴리":["릴리","시라유리","쌰유리"],
    "유나기 엘나":["엘나","엘레나","에레나"],
    "후와모치 안코":["안코"],
    "우타카타 메모리":["메모리"],
    "네코노기 벨":["벨"],
    "크로노 락":["크로노","락"],  # 비비드
    "엠마":["EMA","엠마"],
    "니아 스즈네":["니아","스즈네"], # 기타 그룹
    "유아":["유아","유아앗"],
    "타마키":["타마키", "노리오","미만노","미녀만화가","누리오"],
    "세피라":["세피라"],
    "레오나":["레오나"],
    "퐁코":["퐁코"],
    "후지":["후지", "아오이"],
    "히요코":["히요코"],
    "산토리":["노무","누무"],
    "레네":["레네"],
    "류린":["류린"],
    "레이리":["레이리","가능좌"],
    "카와세":["카와세"],
    "마구로나":["마구로나"], # 개인1
    "토마리":["토마리","따마리"],
    "토마리마마":["토마리마마"],
    "마마츠리":["마마츠리"],
    "카모미":["찐모미","따모미","카모미"],
    "도트쨩":["도트쨩"],
    "요미":["요미나리","요미","오이나리"],
    "텐진 코토네":["텐진","코토네"],
    "사나":["사나","간호사"],
    "카후":["카후"],
    "히마리":["히마리"],
    "우토":["왓슨동생","슨상동생","슨상 동생","왓슨 동생","우토"], 
    "와라베":["웃음할매","웃음창녀","할매","와라베"],
    "유메하 마타네":["마타네","또네","정병","정병쨩","정병장","정병쟝"],
    "아르테미스":["아르테미스","짭상어","큰상어"],
    "텐텐":["텐텐"], 
    "아토리 코토코":["갈꼬","코토코","Atori","KOTOKO","kotoko"],
    "노아":["노아"], # 개인2
    "시구레":["우이"],
    "루루도":["루루도"], 
    "나비":["나비","나비마마","나비 마마"], # 마마...
    "네온":["네온"],
    "히요":["코골이좌","히요","코골좌"],
    "치코":["치코","치꼬"],
    "나즈키":["나즈키"],
    "게로":["게로"], # 하꼬
    "세아":["세아","김세아"],
    "에이브":["에이브"],
    "하나린":["하나린"], # 한튜버 기타
    "츠구":["츠구"],
    "모아":["모아"],
    "마코토":["마코토"], 
    "후렌":["후렌"],
    "오니":["오니"],
    "시오":["시오"],
    "엔카":["엔카","엔카이모","엔카 이모","코죠"],
    "카나":["카나","구라 동생","구라동생"] # 분류 없음
}

nijisanji={
    "츠키노 미토":["미토","욘토","천황","위원장"],# 니지1
    "시즈카 린":["시누나","시줌마","시즈린","시즈카","린","류네"],
    "히구치 카에데":["데롱","카에데"],
    "유우키 치히로":["치히로","치쨩","마법소녀","치재앙","치여사"],
    "모이라":["여신님","모이모이","모이라"],
    "시부야 하지메":["하지메","좆지메"],
    "에루":["에루"],
    "아키":["아키"], 
    "모노노베 아리스":["아리스"], # 니지 2기
    "스즈카 우타코":["우타코"],
    "모리나카 카자키":["카자","카자키"],
    "우시미 이치고":["이치고"],
    "이에나가 무기":["무기"],
    "유우히 리리":["리리"],
    "후시미 가쿠":["가쿠"],
    "켄모치 토우야":["턱","토야","토우야"],
    "후미노 타마키":["타마","좆냥이"],
    "길자렌 3세":["길자렌"],
    "카나에":["카나에","요코"], # 니지 게이머즈
    "사사키 사쿠":["사사키","사쿠"],
    "혼마 히마와리":["히마와리","히마","혼히마"],
    "시이나 유이카":["산시타","시이나","시이시이","찹쌀떡","빵떡","만쥬"],
    "쿠즈하":["쿠즈하","쿠즈"],
    "마카이노 리림":["리림","리리무","이이온나"], # 니지 게이머즈
    "류셴":["류셴","류센","미도리"],# 니지산지 SEEDs 1기
    "클레어":["클레어","수녀"],
    "도라":["도라"],
    "하나바타케 챠이카":["챠이카","챠아카"],
    "야시로 키즈쿠":["키즈쿠","사축","야시키즈"],
    "우즈키 코우":["코우"],
    "이즈모 카스미":["카스미"],
    "스즈키 마사루":["마사루"], 
    "토도로키 쿄코":["쿄코"],
    "아즈치 모모":["모모"],# 니지산지 SEEDs 1기
    "타카야마 리온":["리온","네덕","비틱"],
    "마이모토 케이스케":["마이모토"],
    "칸다 쇼이치":["칸다"], # 니지산지 SEEDs 2기
    "린도 미코토":["미코토","와라와"],
    "죠 리키이치":["리키이치","조힘한","팡대","광대"],
    "데비데비 데비루":["데비루","데비","데빗치","코알라"],
    "사쿠라 리츠키":["리츠키","리츠킨"],
    "마치타 치마":["치마"], # 2차
    "벨몬드 반데라스":["벨몬드","반데라스","반데","벨붕이","반기라스","다레야넹"],
    "유메오 카케루":["유메오", "카게루"],
    "쿠로이 시바":["시바"],
    "야구루마 리네":[],
    "하루사키 에아루":["에아루"],
    "나루세 나루":["나루세","나루","읍슴","산뜻좌","음습좌"], # 3,4차
    "와라베다 메이지":["와라베다","메이지"],
    "유즈키 로아":["유즈키","로아","유즈키상","로커","로에이","로에이챤"],
    "유우히 리리":["미래인"],
    "군도 미레이":["군도","도 미레이","미레이","미.레이","미1레이","미레1이","미래이"],
    "오노마치 하루카":["하루카"],
    "세토 미야코":["미야코"],
    "카타리베 츠무구":["츠무구"],
    "오토기바라 에라":["기바라","에라"],# 니지산지 2019년 1분기
    "리제 헬레스타":["리제","황녀"],
    "양쥬 카트리나":["양쥬","안쥬","안게","앙게"],
    "이뉴이 토코":["개돼지","이뉴이","이누이","케로베로스","토코"],  # 니지산지 2019년 1분기 -2
    "사에구사 아키나":["아키나"],
    "아이노조 미나미":["미나미"],
    "스즈하라 루루":["스즈하라","루루","콘루루","루 루 펀 치","미대생","루기견"],
    "유키시로 마히로":["마히로","마히롱","마히마히","마히"],
    "엑스 에비오":["용사부","에비오"],
    "레비 엘리파":["레비"],"코니파":["엘리파","코니파"],
    "뉴이 소시에르":["뉴이"],
    "하야마 마린":["하야마","하얀마","흑인"], # 니지산지 2019년 2분기
    "카가미 하야토장":["사장","사쵸","타라치오"],
    "요루미 레나":["요루미","레나"],
    "하카세 후유키":["하카세","후유키","박사"],
    "아루스 아르마르":["아르마르","마루마루","아르말","아르스","빵떡","만쥬","찹쌀떡"],
    "아이바 우이하":["우이하"],
    "마유즈미 카이":["마유즈미","마유유","해커"], # 니지산지 2019년 3분기
    "아마미야 코코로":["아마미야","아먀미야","아미미야","코코로","아먀먀","아마먀","메아리","메어리"],
    "랏나 푸티":["푸티","푸테치","음란너구리"],
    "에리":["에리"],
    "스코야 카나":["스코야","스코","내일좌"],
    "하야세 소우":["하야세","소우","런줌마"],
    "셸린 버건디":["버건디"], # 니지산지 2019년 3분기-2
    "호시카와 사라":["호시카와","호사카와","보지가와","보지카와","타피오카","바바밧","스탬프도둑"],
    "후미":["후미"],
    "야마가미 카루타":["카루타","카루","텐구","까마귀군주","따마귀","까마귀"],
    "에마 오우거스트":["에마","바치콩","바치콘"],
    "루이스 캐미":["루이스"],
    "마츠카이 마오":["귓털","마오"], # 니지산지 2019년 4분기
    "후와 미나토":["미나토","말랑이"],
    "구웰 오스 걸":["구웰","다크엘프"],
    "마시로":["마시로","마시롱"],
    "나라카":["나라카"],
    "쿠루스 나츠메":["나츠메","쿠루스"], # 니지산지 2019년 4분기-2
    "프렌 E 루스타리오":["프렌"],
    "메릿사 킨렌카":["킨렌카","김렝가","꿀벌"],
    "아브라힘":["아브라힘","이브라힘","석유왕"], # 니지산지 2020년 1분기
    "나가오 케이":["케이","나가오","백브라힘"],
    "겐즈키 토지로":["토지로"],
    "카이다 하루":["하루"],
    "소라호시 키라메":["키라메"],
    "메이로":["메이로","연근","연꽃눈"],# 니지산지 2020년 2분기
    "아사히나 아카네":["아카네","아코","강남아줌마","강남 아줌마"],
    "스오 산고":["산고","응고","마망"],
    "토도 코하쿠":["코하쿠","노랭","누렁","노랑"],
    "키타코지 히스이":["히스이","상어이빨","히스삐"],
    "니시조노 치구사":["치구사","해바라기","히이로"],# 니지산지 2020년 3분기
    "액시아 크로네": ["액시아","아쿠시아","크로네","악시아","엑시아","에덴구미"],
    "로렌 이로아스": ["로렌","이로아스","에덴구미"],
    "레오스 빈센트": ["레오스","빈센트","마메네코","콩냥이","콩껄룩","에덴구미"],
    "올리버 에반스": ["올리버","에반스","에덴구미"],
    "레인 패터슨": ["레인 패터슨", "레인","에덴구미"], # 니지산지 2021년
    "여관주인":["여관주인"],#???
    "노트":["노트"],
    "마토이":["마토이"],
    "메르":["메르"],
    "아메":["아메"],
    "나리":["나리"], 
    "에리카":["에리카"],
    "노치무":["노치무"],
    "크리스":["크리스"],
    "유키":["유키"], # ?
    "아디아":["아디아"],
    "누르":["누르"], # 니지 IN
    "엘리라 펜도라":["펜도라"], 
    "포무 레인퍼프":["레인퍼프","포무","뽀무","천 하 포 무"],
    "피나나 류구":["피나나","인어","류구"],
    "셀렌 타츠키":["셀렌","타츠키"],
    "로제미 러브락":["로제미","러브락","노재미","꿀재미","대황재미"],
    "페트라 구린":["뗑컨","펭귄","구린"], # 니지 EN
 }
nijikr={
    "신유야":["신유야","유야"],
    "위피":["위피"],
    "유루리":["유루리","루리","모뉴뉴"],
    "민수하":["민수하","수하","임포쟈나이","898","수브딱"], # 니지 KR 1
    "채아라":["채아라","치아라","아라눈나","아라","아르신"],
    "소나기":["소나기","나기"],
    "한치호":["한치호","치호도령","치호","짱깨안경"],
    "이시우":["이시우","시우","김치수장"], # 니지 KR 2
    "이로하":["로하","이로하","에로하","로헤이챤"],
    "눈보라":["눈보라","보라","bora","boraさん","난스프","눈스프"],
    "레이":["레이","기소령","군도미","분위기경찰"], # 니지 KR 3
    "류하리":["류하리","작은이모","하리","작은 이모"],
    "신기루":["신기루","기루","지루"], 
    "양나리":["양나리","나리"],
    "오지유":["오지유","지유","잼민이"], # 니지 KR 4
    "반하다":["반하다"],
    "세피나":["세피나","피나"],
    "송미아":["송미아","미아"],
    "고야미":["고야미"],
    "나세라":["나세라"],
    "이온":["이온"],
    "하윤":["하윤"]
}



hololive={
    "토키노 소라":["소라","곰","곰누나"], 
    "에이짱":["에이짱","에이쟝","에이쨩"],
    "로보코":["로보코","고성능","도로보","퐁코츠"],# 홀로 0기
    "시라카미 후부키":["후부키","후재앙","요키잇","수장"],
    "아카이 하아토":["하아토","우리딸","오하루쥬","하아짜마","하아쨔마","하쨔마","하짜마","하챠마","느그딸","우리병신","느그병신","우리빡통","느그빡통"],
    "나츠이로 마츠리":["마츠리","라팡","라도팡주","고토","노조미"],
    "요조라 메루":["메루","멜"],
    "아키 로젠탈":["아키로제","로젠탈"], # 홀로1 
    "미나토 아쿠아":["아쿠아","아크아","아쿠킨","아티시","아타시","아틔시","아타싀","악취시","냄틔시","양파"],
    "나키리 아야메":["아야메","오죠","파코요"],
    "무라사키 시온":["시온","쿠소가키","쿠소","쿠로아"],
    "유즈키 초코":["초코","초쿄","초쿄센세","초코센세"],
    "오오조라 스바루":["스바루","슈바슈바","스바스바","오리","스바우"], # 홀로 2
    "오오카미 미오":["미오"],
    "이누가미 코로네":["코로네","코로상","코오네","오카코로","미코로네","코로이모","개이모","개누나","개 누나","개 이모"],
    "네코마타 오카유":["오카유","오카코로"], # 홀로게임
    "호쇼 마린":["마린선장","마린","센쵸", "센초","선장","키미타치","키미땃쥐","호쇼","페코마린","페코마리","땃쥐맘","마리루시","마리후레"],
    "시라누이 후레아":["후땅","후레아","시라누이","마리후레","흑인","니거"],
    "우루하 루시아":["루굴","루시아","캠굴","미케네코","마리루시"],
    "우사다 페코라":["우사다","페코라","이토우","우페","페코","빼꺼","파코라","미코페코","페코미코","토끼","토끼년","페코무나","혐끼","페코마리","페코마린"],
    "시로가네 노엘":["노엘","단장","카난","누엘","족장"], # 홀로3
    "츠노마키 와타메":["츠노마키","와타메","와타멜론","watamelon","양 이모","양이모","콘방도도도","도도도","역전우동",],
    "토코야미 토와":["토와","토와사마","콘얍삐","군와","톼삼","퇴삼","퇴1삼","나루미","카나토와"],
    "아마네 카나타":["카나타","텐시","카나땅","카나스이","가짜천사","가짜","pp텐시","pp천사","PP천사","PP텐시","가짜고릴라","고릴라년","짝귀","진짜천사","가짜가짜","진짜진짜","카나토와","노조무","거근천사"],
    "키류 코코":["코코","회장","크손"],
    "히메모리 루나":["루나","모루루나","모루루","응나","응나이모","응나 이모","나노라"], # 홀로 4
    "유키하나 라미":["라미","청소부"],
    "모모스즈 네네":["네네","네네치","네넷치","바보병신"],
    "시시로 보탄":["보탄","노사연","누사연","시시롱","암사자"],
    "마노 알로에":["알로에"],
    "오마루 폴카":["오마루","폴카","노부히메","누부히메","메가히메","포포포","포포포포","포포포포포", "포포포 포포","포","ぽ"],# 홀로 5
    "사쿠라 미코":["미코","미꼬","똥코","똥꼬","야겜좌","도박좌","미코페코","페코미코","미코로네","미코멧"],
    "호시마치 스이세이":["호시마치","스이세이","스이","스이짱","스이쨩","카나스이","미코멧","파란아야메"], # 홀로 etc
    "모리 칼리오페":["칼리오페","사신", "타카모리"],
    "타카나시 키아라":["키아라","치킨", "타카모리","케키히메"],
    "니노마에 이나니스":["문어","문어눈나","이나니스","이나","무너","타코","무노","무누"],
    "가울 구라":["상어","구라","구라짱","구라쨩"],
    "왓슨 아멜리아":["왓슨","왓슨상","아멜리아","탐정","슨상","아메"],
    "IRyS":["IRyS","아이리스","나미린","namirin"], # 홀로 en 1
    "츠쿠모 사나":["사나","흑인","깜둥이"],
    "세레스 파우나":["파우나","노루","나무위키 여신","나무위키여신","녹라미","녹색라미","나무위키"], # 홀로 en 2
    "오로 크로니":["크로니","피아제","시계","시계누나","시계눈나", "시계 눈나", "시계 누나"],
    "나나시 무메이":["무메이","부엉이"],
    "하코즈 벨즈":["하코스","하코즈","밸즈","벨즈","가카","쥐","생쥐","땃1쥐","땃쥐"],
    "요키":["요키"],
    "이즈루":["이즈루"],
    "미야비":["미야비"],
    "키라":["키라"],
    "아르란디스":["아루란","아루란디스","아르란디스","아르란"], # 홀로스타즈
    "쿠레이지 올리":["올리","좀비"],
    "무나 호시노바":["무나","페코무나"],
    "이오피":["이오피"],
    "리스":["리스"],
    "아냐 멜핏사":["아냐","멜핏사"],
    "파볼리아 레이네":["파볼리아","레이네"]# 홀로 인도네시아
 }

youtube={
    "케모노즈":"KMNZ ARCHIVES",
    "리타":"KMNZ LITA",
    "리즈":"KMNZ LIZ",
    "츠키노 미토":"月ノ美兎",
    "IRyS":"*namirin",
    "IRyS":"IRyS Ch. hololive-EN",
    "치마":"町田ちま【にじさんじ】",
    "요메미":"ヨメミ -萌実- エトラ チャンネル",
    "키즈나 아이":"A.I.Channel",
    "키즈나 아이":"A.I.Games",
    "이오피":"AiraniIofifteenChannelhololive-ID",
    "이오피":"Airani Iofifteen Channel hololive-ID",
    "아냐 멜핏사":"AnyaMelfissaCh.hololive-ID",
    "미나토 아쿠아":"AquaCh.湊あくあ",
    "아르테미스":"ArtemisoftheBlueCh.",
    "리스":"AyundaRisuCh.hololive-ID",
    "AZKi":"AZKiChannel",
    "AZKi":"AZKi Channel",
    "시시로 보탄":"BotanCh.獅白ぼたん",
    "시시로 보탄":"Botan Ch.獅白ぼたん",
    "카모미":"CAMOMICamomiChannel【鴨見カモミ】",
    "유즈키 초코":"ChocoCh.癒月ちょこ",
    "키류 코코":"CocoCh.桐生ココ",
    "키류 코코":"kson ONAIR",
    "키류 코코":"ksonONAIR",
    "카구야":"Kaguya Luna Official",
    "시라누이 후레아":"FlareCh.不知火フレア",
    "":"game_Ch.フライングパンケーキ",
    "가울 구라":"GawrGuraCh.hololive-EN",
    "":"GEMSCOMPANY公式チャンネル",
    "":"GeroniBro(ジェロニブロ)",
    "아카이 하아토":"HAACHAMACh赤井はあと",
    "아마네 카나타":"KanataCh.天音かなた",
    "이누가미 코로네":"KoroneCh.戌神ころね",
    "쿠레이지 올리":"KureijiOllieCh.hololive-ID",
    "마구로나":"Magronachannel/まぐろなちゃんねる",
    "호쇼 마린":"MarineCh.宝鐘マリン",
    "세키시로 미코":"MicoChannel/堰代ミコ【ハニスト】",
    "사쿠라 미코":"MikoCh.さくらみこ",
    "시로미야 미미":"MimiChannel/白宮みみ【あにまーれ】",
    "오오카미 미오":"MioChannel大神ミオ",
    "미라이 아카리":"MiraiAkariProject",
    "무나 호시노바":"MoonaHoshinovahololive-ID",
    "모리 칼리오페":"MoriCalliopeCh.hololive-EN",
    "나키리 아야메":"NakiriAyameCh.百鬼あやめ",
    "모모스즈 네네":"NeneCh.桃鈴ねね",
    "니아 스즈네":"NiaSuzune/鈴音にあ[PRISMProject]",
    "니노마에 이나니스":"NinomaeIna'nisCh.hololive-EN",
    "시로가네 노엘":"NoelCh.白銀ノエル",
    "네코마타 오카유":"OkayuCh.猫又おかゆ",
    "스오우 파토라":"Patra Channel / 周防パトラ 【ハニスト】",
    "스오우 파토라":"PatraChannel/周防パトラ【ハニスト】",
    "우사다 페코라":"PekoraCh.兎田ぺこら",
    "포무 레인퍼프":"PomuRainpuff【NIJISANJIEN】",
    "로보코":"RobocoCh.-ロボ子",
    "우루하 루시아":"RushiaCh.潤羽るしあ",
    "시즈카 린":"ShizukaRinOfficial",
    "시즈카 린":"Shizuka Rin Official",
    "토키노 소라":"SoraCh.ときのそらチャンネル",
    "오오조라 스바루":"SubaruCh.大空スバル",
    "호시마치 스이세이":"SuiseiChannel",
    "호시마치 스이세이":"Suisei Channel",
    "타카나시 키아라":"TakanashiKiaraCh.hololive-EN",
    "텐텐":"TentenCh./鳳玲天々",
    "토코야미 토와":"Towa Ch. 常闇トワ",
    "츠노마키 와타메":"WatameCh.角巻わため",
    "모이라":"《にじさんじ所属の女神》モイラ",
    "히구치 카에데":"樋口楓【にじさんじ所属】",
    "유우키 치히로":"勇気ちひろ",
    "오메가 시스터즈":"おめがシスターズ [Ω Sisters]",
    "오메가 시스터즈":"おめがシスターズ[ΩSisters]",
    "모치 히요코":"もちひよこ",
    "카시코 마리":"Mari Channelかしこまり",
    "카시코 마리":"MariChannelかしこまり",
    "유니":"YuNi - official channel -",
    "유니":"YuNi-officialchannel-",
    "히비키 아오":"響木アオ-HibikiAo-",
    "코코츠키":"ココツキ CocoTsuki Project",
    "코코츠키":"ココツキCocoTsukiProject",
    "이나바 하네루":"Haneru Channel / 因幡はねる 【あにまーれ】",
    "이나바 하네루":"HaneruChannel/因幡はねる【あにまーれ】",
    "히노쿠마 란타로":"Ran Channel / 日ノ隈らん 【あにまーれ】",
    "히노쿠마 란타로":"RanChannel/日ノ隈らん【あにまーれ】",
    "소우야 이치카":"Ichika Channel / 宗谷 いちか 【あにまーれ】",
    "소우야 이치카":"IchikaChannel/宗谷いちか【あにまーれ】",
    "히카리":"Hikari Channel / 飛良ひかり 【あにまーれ】",
    "히카리":"HikariChannel/飛良ひかり【あにまーれ】",
    "카제미 쿠쿠":"Kuku Channel / 風見くく 【あにまーれ】",
    "카제미 쿠쿠":"KukuChannel/風見くく【あにまーれ】",
    "시로미야 미미":"Mimi Channel / 白宮みみ 【あにまーれ】",
    "시로미야 미미":"MimiChannel/白宮みみ【あにまーれ】",
    "아마미야 코코로":"めありーちゃんねる",
    }

exceptholo={}
exceptholo.update(vtuber_origin)
exceptholo.update(nijisanji)
exceptholo.update(nijikr)

vtuber={}
vtuber.update(vtuber_origin)
vtuber.update(nijisanji)
vtuber.update(nijikr)
vtuber.update(hololive)

nicknames=[]
for name in vtuber:
    nicknames.extend(vtuber[name])