word_dict={
    "게이머":["게임","겜","어쌔신크리드","어크","몬스터헌터","몬헌","롤","포켓몬","아크","데바데","마리오","마리카","다크소울","닼소","망겜","배그","에펙","에이펙스","발로란트","포탈","마크","마인크","링피트","롤드컵","폴가이즈","폴가이지","폴거이즈","원신","히오스","어몽어스","팜스포비아","파즈모포비아","홀몽어스","홀몽","니지어스","샤니마스","샤니","똥퍼","스플래툰","스플레툰","스펠렁키","사이퍼펑크","사펑","언더테일","언텔","샌즈","쿠키요미"],
    "성희롱":["사정하","사정관리","박히","처녀","ntr","NTR","먹고 싶","따먹","똥코","똥꼬","엉덩이","젖","펠라","펨돔","암컷무브","시모네타","뷰지","쥬지","오프파코","보지","성희롱","빨고","빨아","하고 싶","파코","맘마통","똥꼬","똥코","야해","야한","씹걸래","걸래","피싸","피임","야스","꼴리"],
    "나쁜말":["몸캠","배빵","씹", "즙","좆","병신","씨발","시발","존나","씹창","죽이"],
    "중계":["youtube","youtu.be"],
    "호감":["[^비]호감"],
    "비호감":["비호감"],
    "미인":["이쁜","이쁘","예쁜","잘생","미인"],
    "못생김":["못생"],
    "꿀잼":["꿀잼","재밌","재미있","재미 있", "예능",],
    "노잼":["노잼","재미없", "재미 없"]
}