#-*- coding: utf-8 -*-

vtuber_origin = {
    "키즈나 아이": [
        "키즈나 아이", "키즈나아이", "기즈나", "야붕이", "야붕", "오야붕", "1붕", "2붕", "3붕", "4붕",
        "중붕", "짱붕"
    ],  # 키즈나 아이 코퍼레이션?
    "오메가 시스터즈": ["오메시스"],  # up8
    "모치 히요코": ["히요코"],
    "카시코 마리": ["짱마리"],  # up8 뮤직 
    "유니": ["유니", "YuNi"],
    "히비키 아오": ["아오", "히비키"],
    "코코츠키": ["코코츠키"],
    "이나바 하네루": ["하네루", "네루", "근혜루", "이나바", "네루네루태풍", "네루네루 태풍"],  # 아니마레, 허니스토
    "히노쿠마 란타로": ["란타로"],
    "소우야 이치카": ["이치카"],
    "유노하라 이즈미": ["이즈미"],
    "히라 히카리": ["히카리"],
    "카제미 쿠쿠": ["쿠쿠"],
    "시로미야 미미": ["미미", "개좆미", "개좆미미", "좆미", "대황미미", "대황미"],
    "나나시": ["나나시"],
    "스오우 파토라": ["파트라", "파토라"],
    "세키시로 미코": ["세키시로", "공포의 군주", "공군", "공포의군주"],
    "미라이 아카리": ["미라이", "아카리"],  # 엔텀
    "네코미야 히나타": ["네코미야", "히나타", "사기고양이"],
    "우카": ["우카"],
    "시로": ["시로", "파잉"],
    "피망군": ["피망군"],
    "바아차루": ["바아차루", "버차루"],  # 앱랜드
    "치에리": ["치에리"],
    "메메메": ["메메메"],
    "이로하": ["이로하", "콩고"],
    "후타바": ["후타바"],
    "피노": ["피노"],
    "스즈": ["스즈"],
    "나토리": ["나토리"],
    "이오리": ["이오리"],  # 앱랜드 아이돌부
    "메리": ["메리", "밀크"],  # 앱랜드 기타
    "히메히나": ["히메히나", "히메", "히나"],  # 히메히나
    "유게": ["유게"],
    "얌미": ["얌미"],
    "챠로": ["챠로"],
    "유이": ["유이"],  # 브이게이밍
    "게임부": ["게임부", "겜부"],
    "하루토": ["하루토"],
    "부장": ["유메사키", "부장", "카에데"],
    "미리아": ["미리아"],
    "료": [],
    "코코아": ["코코아"],  # 게임부
    "에이렌": ["에이렌", "에일렌"],
    "요메미": ["요메미"],
    "모에미": ["모에미"],
    "에네": ["에네"],
    "베일렌": ["베일렌"],  # 에일렌가
    "케모노즈": ["kmnz", "케모노즈"],
    "리타": ["대리한타", "리타", "대한리타"],
    "리즈": ["리즈"],  # KMNZ
    "카구야": ["카구야루나", "쭀"],
    "핑키": ["핑키", "햇반", "햇번"],  # 문 스튜디오
    "파리프로": ["파리프로", "파리마마"],
    "페르미": ["페르미"],  # 진공관
    "하노": [],  # 리액트
    "레이리": ["가능좌", "레이리"],
    "리본": ["리본"],
    "피카미": ["피카미", "끠까미", "끠카미"],  # GYARI
    "야시키 시엘": ["시엘", "프랑스", "프랑스 이모", "프랑스이모", "프랑스누나", "프랑스 누나"],  # 브이센
    "뉴뉴": ["뉴뉴"],
    "아즈마 림": ["아즈림", "아즈마", "리무", "드럼통"],
    "아사노 루리": ["루리"],
    "루키로키": ["루키로키"],
    "테마리": ["테마리", "키갤 조카", "조카"],  # MaHOROBA
    "시라유리 릴리": ["릴리", "시라유리", "쌰유리"],
    "유나기 엘나": ["엘나", "엘레나", "에레나"],
    "후와모치 안코": ["안코"],
    "우타카타 메모리": ["메모리"],
    "네코노기 벨": ["네코노기"],
    "크로노 락": ["크로노", "락"],  # 비비드
    # "린":["린"], wtf
    "마루 나나모나": ["나나모나"],
    "히토시로 이즈키": ["이즈키"],
    "카가세 우노": ["우노"],
    "알바 세라": ["세라"],
    "키시 오토하": ["오토하"],
    "kson": ["코코", "크손", "회장", "총장", "kson", "촌장"],  # VerseN
    "엠마": ["EMA", "엠마"],
    "니아 스즈네": ["니아", "스즈네"],  # 기타 그룹
    "유아": ["유아", "유아앗"],
    "타마키": ["타마키", "노리오", "미만노", "미녀만화가", "누리오"],
    "시라카미 미시로": ["미시로"],
    "와라베": ["웃음할매", "웃음창녀", "할매", "와라베"],
    "에노미아 밀크": ["밀크"],
    "쿠마가야 타쿠마": ["타쿠마"],
    "히메사키 유즈루": ["유즈루"],
    "오우마 키라라": ["키라라"],
    "쿠루미자와 모모": ["쿠루미자와"],
    "이나리 이로하": ["이나리"],
    "레그루슈 라이온하트": ["라이온하트"],
    "네코제노 신": ["네코제노"], # 노리프로
    "세피라": ["세피라"],
    "레오나": ["레오나"],
    "퐁코": ["퐁코"],
    "후지": ["후지", "아오이"],
    "히요코": ["히요코"],
    "산토리": ["노무", "누무"],
    "레네": ["레네"],
    "류린": ["류린"],
    "레이리": ["레이리", "가능좌"],
    "카와세": ["카와세"],
    "마구로나": ["마구로나"],
    "우유 클로버": ["우유", "키갤조카", "키갤 조카"],  # 개인1
    "토마리": ["토마리", "따마리"],
    "토마리마마": ["토마리마마"],
    "마마츠리": ["마마츠리"],
    "카모미": ["찐모미", "따모미", "카모미"],
    "도트쨩": ["도트쨩"],
    "요미": ["요미나리", "요미", "오이나리"],
    "텐진 코토네": ["텐진", "코토네"],
    "사토리 사나": ["간호사"],
    "카후": ["카후"],
    "히마리": ["히마리"],
    "우토": ["왓슨동생", "슨상동생", "슨상 동생", "왓슨 동생", "우토"],
    "유메하 마타네": ["마타네", "또네", "정병", "정병쨩", "정병장", "정병쟝"],
    "아르테미스": ["아르테미스", "짭상어", "큰상어"],
    "텐텐": ["텐텐"],
    "아토리 코토코": ["갈꼬", "코토코", "Atori", "KOTOKO", "kotoko"],
    "노아": ["노아"],
    "DELUTAYA Δ.": ["데루타야", "데루타", "델타"],  # 개인2
    "시구레 우이": ["우이", "우이마마", "소믈리에", "우이 마마"],
    "루루도": ["루루도"],
    "나비": ["나비", "나비마마", "나비 마마"],  # 마마...
    "네온": ["네온"],
    "히요": ["코골이좌", "히요", "코골좌"],
    "치코": ["치코", "치꼬"],
    "나즈키": ["나즈키"],
    "게로": ["게로"],
    "요스즈": ["요스즈", "용꼬", "용하꼬"],
    "미즈키": ["미즈키"],  # 하꼬
    "아스트 더 데우스": ["데우스"],
    "아지카타 유논": ["유논"],
    "에블리스 쵸키": ["쵸키"],
    "피요": ["피요"],  # 브이레코드
    "아스트 더 데우스": ["데우스"],
    "아지카타 유논": ["유논"],
    "에블리스 쵸키": ["쵸키"],
    "벨디르 미스틸테인": ["미스틸테인"],
    "다프네": ["다프네"],
    "이아나 이그노시스": ["이그노시스"],
    "메메": ["메메"],
    "시트리": ["시트리"],
    "야호": ["야호"],
    "아리멍뭉": ["아리멍뭉"],
    "유연": ["유연"],  # 브이러브
    "세아": ["세아", "김세아"],
    "에이브": ["에이브"],
    "하나린": ["하나린"],
    "이주인": ["이주인", "주인님", "롤미녀", "신유야", "유야"],
    "마오루야": ["마왕루야", "마오루야"], 
    "셀리나 아이즈펠트": ["셀리나","오이지펠트"],# 한튜버 기타
    "츠구": ["츠구"],
    "모아": ["모아"],
    "마코토": ["마코토"],
    "후렌": ["후렌"],
    "오니": ["오니"],
    "시오": ["시오"],
    "엔카": ["엔카", "엔카이모", "엔카 이모", "코죠"],
    "오토와 린네": ["파꼬", "린네"],
    "카미노 레이토": ["칭꼬", "레이토", "카미노", "코죠"],
    "마도카": ["파꼬", "린네"],
    "스즈카 스텔라": ["스텔라"],  # 
    "히엔 마도카": ["마도카"],  # 
    "나유타": ["보라하꼬"],  # 
    "이주인": ["이주인", "주인님", "신유야", "유야", "롤미녀"],  # 
    # "카나":["카나","구라 동생","구라동생"], # 분류 없음
    "요스즈": ["용꼬", "요스즈", "용하꼬"],
    "사키": ["사키"],
    "하나땅": ["하나땅", "꽃이모"],
    "무앙": ["무앙"],
    "아이언마우스": ["아이언마우스", "철쥐"],
    "마이사키 베리": ["베리"],
    "요시카": ["요시카", "고구마"],  # 분류 없음
    "카구라 메아": ["메아", "좆의 메아"],  # 구 파리프로
    # "미케네코":["루굴","루시아","미케네코","루굴이","네크로맨서"],
    "나즈나": ["루굴", "루시아", "미케네코", "루굴이", "네크로맨서", "나즈나"],
    "미리쿠룬": ["미리쿠룬", "미리리", "루루리카", "리쿠무"],  # 닷라이브
    # "시죠 유리":["유리"], #
    "카나우": ["카나우"],  # 
    "MUS1CA": ["MUS1CA"],  # 
    # 닷라이브 미리쿠룬(미리리 루루리카 리쿠무)
    # 레네, 타마파레, 시죠 유리 , 카나우, MUS1CA
    "네코타 츠나": ["보라", "눈보라", "츠나", "츠나상"],  # 브이스포  
    "우주 크리아": ["로켓이모", "로켓 이모"],  #   
    "마리 요노": ["유니콘이모", "유니콘 이모"],  #
    "카나": ["구라 동생", "구라동생"],
    "마츠나가 이오리": ["이오리"],
    "히즈키 루루후": ["루루후"],  # 분류 없음
}

nijisanji = {
    "츠키노 미토": ["미토", "욘토", "천황", "위원장"],  # 니지1
    "시즈카 린": ["시누나", "시줌마", "시즈린", "시즈카", "류네"],
    "히구치 카에데": ["데롱", "카에데"],
    "유우키 치히로": ["치히로", "치쨩", "마법소녀", "치재앙", "치여사"],
    "모이라": ["여신님", "모이모이", "모이라"],
    "시부야 하지메": ["하지메", "좆지메"],
    "에루": ["에루"],
    "아키": ["아키"],
    "모노노베 아리스": ["아리스"],  # 니지 2기
    "스즈카 우타코": ["우타코"],
    "모리나카 카자키": ["카자", "카자키"],
    "우시미 이치고": ["이치고"],
    "이에나가 무기": ["이에나가", "무기"],
    "유우히 리리": ["리리", "미래인"],
    "후시미 가쿠": ["가쿠"],
    "켄모치 토우야": ["턱", "토야", "토우야"],
    "후미노 타마키": ["타마", "좆냥이"],
    "길자렌 3세": ["길자렌"],
    "카나에": ["카나에", "요코"],  # 니지 게이머즈
    "사사키 사쿠": ["사사키", "사쿠"],
    "혼마 히마와리": ["히마와리", "히마", "혼히마"],
    "시이나 유이카": ["산시타", "시이나", "시이시이", "찹쌀떡", "빵떡", "만쥬"],
    "쿠즈하": ["쿠즈하", "쿠즈"],
    "마카이노 리림": ["리림", "리리무", "이이온나"],  # 니지 게이머즈
    "류셴": ["류셴", "류센", "미도리"],  # 니지산지 SEEDs 1기
    "클레어": ["클레어", "수녀"],
    "도라": ["도라"],
    "하나바타케 챠이카": ["챠이카", "챠아카"],
    "야시로 키즈쿠": ["키즈쿠", "사축", "야시키즈"],
    "우즈키 코우": ["코우"],
    "이즈모 카스미": ["카스미"],
    "스즈키 마사루": ["마사루"],
    "토도로키 쿄코": ["쿄코"],
    "아즈치 모모": ["모모"],  # 니지산지 SEEDs 1기
    "타카야마 리온": ["리온", "네덕", "비틱"],
    "마이모토 케이스케": ["마이모토"],
    "칸다 쇼이치": ["칸다"],  # 니지산지 SEEDs 2기
    "린도 미코토": ["미코토", "와라와"],
    "죠 리키이치": ["리키이치", "조힘한", "팡대", "광대"],
    "데비데비 데비루": ["데비루", "데비", "데빗치", "코알라"],
    "사쿠라 리츠키": ["리츠키", "리츠킨"],
    "마치타 치마": ["마치타"],  # 2차
    "벨몬드 반데라스": ["벨몬드", "반데라스", "반데", "벨붕이", "반기라스", "다레야넹"],
    "유메오 카케루": ["유메오", "카게루"],
    "쿠로이 시바": ["시바"],
    "야구루마 리네": [],
    "하루사키 에아루": ["에아루"],
    "나루세 나루": ["나루세", "나루", "읍슴", "산뜻좌", "음습좌"],  # 3,4차
    "와라베다 메이지": ["와라베다", "메이지"],
    "유즈키 로아": ["유즈키", "로아", "유즈키상", "로커", "로에이", "로에이챤"],
    "군도 미레이": ["군도", "도 미레이", "미레이", "미.레이", "미1레이", "미레1이", "미래이"],
    "오노마치 하루카": ["하루카"],
    "세토 미야코": ["미야코"],
    "카타리베 츠무구": ["츠무구"],
    "오토기바라 에라": ["기바라", "에라"],  # 니지산지 2019년 1분기
    "리제 헬레스타": ["리제", "황녀"],
    "양쥬 카트리나": ["양쥬", "안쥬", "안게", "앙게"],
    "이뉴이 토코": ["개돼지", "이뉴이", "이누이", "케로베로스", "토코"],  # 니지산지 2019년 1분기 -2
    "사에구사 아키나": ["아키나"],
    "아이노조 미나미": ["미나미"],
    "스즈하라 루루": ["스즈하라", "루루", "콘루루", "루 루 펀 치", "미대생", "루기견", "미스미"],
    "유키시로 마히로": ["마히로", "마히롱", "마히마히", "마히"],
    "엑스 에비오": ["용사부", "에비오"],
    "레비 엘리파": ["레비"],
    "코니파": ["엘리파", "코니파"],
    "뉴이 소시에르": ["뉴이"],
    "하야마 마린": ["하야마", "하얀마"],  # 니지산지 2019년 2분기
    "카가미 하야토장": ["사장", "사쵸", "타라치오"],
    "요루미 레나": ["요루미", "레나"],
    "하카세 후유키": ["하카세", "후유키", "박사"],
    "아루스 아르마르": ["아르마르", "마루마루", "아르말", "아르스", "빵떡", "만쥬", "찹쌀떡"],
    "아이바 우이하": ["우이하"],
    "마유즈미 카이": ["마유즈미", "마유유", "해커"],  # 니지산지 2019년 3분기
    "아마미야 코코로": ["아마미야", "아먀미야", "아미미야", "코코로", "아먀먀", "아마먀", "메아리", "메어리"],
    "랏나 푸티": ["푸티", "푸테치", "음란너구리"],
    "에리": ["에리"],
    "스코야 카나": ["스코야", "스코", "내일좌"],
    "하야세 소우": ["하야세", "소우", "런줌마"],
    "셸린 버건디": ["버건디"],  # 니지산지 2019년 3분기-2
    "호시카와 사라": ["호시카와", "호사카와", "보지가와", "보지카와", "스탬프도둑"],
    "후미": ["후미"],
    "야마가미 카루타": ["카루타", "카루", "텐구", "까마귀군주", "따마귀", "까마귀"],
    "에마 오우거스트": ["에마", "바치콩", "바치콘"],
    "루이스 캐미": ["루이스"],
    "마츠카이 마오": ["귓털", "마오"],  # 니지산지 2019년 4분기
    "후와 미나토": ["미나토", "말랑이"],
    "구웰 오스 걸": ["구웰", "다크엘프", "수학귀신"],
    "마시로": ["마시로", "마시롱"],
    "나라카": ["나라카"],
    "쿠루스 나츠메": ["나츠메", "쿠루스"],  # 니지산지 2019년 4분기-2
    "프렌 E 루스타리오": ["프렌"],
    "메릿사 킨렌카": ["킨렌카", "김렝가", "꿀벌"],
    "아브라힘": ["아브라힘", "이브라힘", "석유왕"],  # 니지산지 2020년 1분기
    "나가오 케이": ["케이", "나가오", "백브라힘"],
    "겐즈키 토지로": ["토지로"],
    "카이다 하루": ["카이다"],
    "소라호시 키라메": ["키라메"],
    "메이로": ["메이로", "연근", "연꽃눈"],  # 니지산지 2020년 2분기
    "아사히나 아카네": ["아카네", "아코", "강남아줌마", "강남 아줌마"],
    "스오 산고": ["산고", "응고", "마망"],
    "토도 코하쿠": ["코하쿠", "노랭", "누렁", "노랑"],
    "키타코지 히스이": ["히스이", "상어이빨", "히스삐"],
    "니시조노 치구사": ["치구사", "해바라기", "히이로", "김치구사"],  # 니지산지 2020년 3분기
    "액시아 크로네": ["액시아", "아쿠시아", "크로네", "악시아", "엑시아", "에덴구미"],
    "로렌 이로아스": ["로렌", "이로아스", "에덴구미"],
    "레오스 빈센트": ["레오스", "빈센트", "마메네코", "콩냥이", "콩껄룩", "에덴구미"],
    "올리버 에반스": ["올리버", "에반스", "에덴구미"],
    "레인 패터슨": ["레인 패터슨", "레인", "에덴구미"],  # 니지산지 2021년
    "우미세 요츠하": ["요츠하"],
    "아마가세 무유": ["무유"],
    "폰토 네이": ["네이"],
    "햐쿠만텐바라 살로메": ["살로메", "일십백천만"],
    "후우라 카나토": ["카나토"],
    "와타라이 히바리": ["히바리"],
    "시키나기 아키라": ["아키라"],
    "세라프 다즐가든": ["다즐가든"],  # 니지산지 2022년
    "여관주인": ["여관주인"],  #???
    "노트": ["노트"],
    "마토이": ["마토이"],
    "메르": ["메르"],
    "나리": ["나리"],
    "에리카": ["에리카"],
    "노치무": ["노치무"],
    "크리스": ["크리스"],
    "유키": ["유키"],  # ?
    "아디아": ["아디아"],
    "누르": ["누르"],
    "타카 라지만": ["라지만"],
    "하나 마키아": ["마키아"],
    "제아 코르넬리아": ["코르넬리아", "제아"],
    "라이 갈릴레이": ["갈릴레이"],
    "아미시아 미셸라": ["미셸라"],
    "미유 오타비아": ["오타비아"],
    "릭사 디렌드라": ["디렌드라"],
    "아주라 세실리아": ["세실리아"],
    "나라 하라마웅": ["하라마웅"],
    "라일라 알스트로에메리아": ["알스트로에메리아"],
    "에트나 크림슨": ["크림슨"],
    "본니비엘 프라나쟈": ["프라나쟈"],
    "시스카 레온타인": ["레온타인"],
    "나기사 아르시니아": ["아르시니아"],
    "데렘 카도": ["카도"],
    "레자 아반루나": ["아반루나"],
    "효나 엘라티오라": ["엘라티오라"],
    "시아 에카비라": ["에카비라"],
    "미카 멜라티카": ["멜라티카"],  # 니지 IN
    "엘리라 펜도라": ["펜도라", "엘리라"],
    "포무 레인퍼프": ["레인퍼프", "포무", "뽀무", "천 하 포 무"],
    "피나나 류구": ["피나나", "인어", "류구"],
    "셀렌 타츠키": ["셀렌", "타츠키"],
    "로제미 러브락": ["로제미", "러브락", "노재미", "꿀재미", "대황재미"],
    "페트라 구린": ["구린"],
    "니나 코사카": ["코사카"],
    "레이무 엔도우": ["엔도우"],
    "밀리 파르페": ["파르페", "짭네네"],
    "아이크 이브랜드": ["이브랜드"],
    "미스타 리아스": ["리아스"],
    "복스 아쿠마": ["아쿠마"],
    "루카 카네시로": ["카네시로"],
    "슈 야미노": ["야미노"],
    "알반 녹스": ["녹스"],
    "유고 아스마": ["아스마"],
    "풀거 오비드": ["오비드"],
    "소니 브리스코": ["브리스코"],
    "우키 비올레타": ["비올레타"],
    "쿄 카네코": ["카네코"],
    "마리아 마리오네트": ["마리오네트"],
    "아스터 아르카디아": ["아르카디아"],
    "아이아 아마레": ["아마레"],
    "렌 조토": ["조토", "조또"],
    "스칼레 요나구니": ["스칼레", "스칼렛", "요나구니"],
    "에나 알루에트": ["알루에트"],  # 니지 EN
}
nijikr = {
    "신유야": ["신유야", "유야"],
    "위피": ["위피"],
    "유루리": ["유루리", "루리", "모뉴뉴"],
    "민수하": ["민수하", "수하", "임포쟈나이", "수브딱"],  # 니지 KR 1
    "채아라": ["채아라", "치아라", "아라눈나", "아라", "아르신"],
    "소나기": ["소나기", "나기"],
    "한치호": ["한치호", "치호도령", "치호", "짱깨안경"],
    "이시우": ["이시우", "시우", "김치수장"],  # 니지 KR 2
    "이로하": ["로하", "에로하", "로헤이챤", "짭로하"],
    "눈보라": ["눈보라", "보라", "bora", "boraさん", "난스프", "눈스프"],
    "아키라 레이": ["아키라", "군도미"],  # 니지 KR 3
    "류하리": ["류하리", "작은이모", "하리", "작은 이모"],
    "신기루": ["신기루", "기루", "지루"],
    "양나리": ["양나리", "나리"],
    "오지유": ["오지유", "지유", "잼민이"],  # 니지 KR 4
    "반하다": ["반하다"],
    "세피나": ["세피나", "피나"],
    "송미아": ["송미아"],
    "고야미": ["고야미", "코야미"],
    "나세라": ["나세라", "핑라미"],
    "이온": ["이온"],
    "하윤": ["하윤"]
}

hololive = {
    "토키노 소라": ["소라", "곰", "곰누나", "사단장"],
    "에이짱": ["에이짱", "에이쟝", "에이쨩", "A짱"],
    "로보코": ["로보코", "고성능", "도로보", "퐁코츠", "노보코"],  # 홀로 0기
    "시라카미 후부키": ["후부키", "후재앙", "후부미오", "바카타레", "후수장", "쿠로카미"],
    "아카이 하아토": [
        "하아토", "우리딸", "오하루쥬", "하아짜마", "하아쨔마", "하쨔마", "하짜마", "하챠마", "느그딸",
        "우리병신", "느그병신", "우리빡통", "느그빡통"
    ],
    "나츠이로 마츠리": ["마츠리", "라팡", "라도팡주", "고토", "노조미", "강도"],
    "요조라 메루": ["메루", "멜", "메루키스", "리카"],
    "아키 로젠탈": ["아키로제", "로젠탈", "무키로제"],  # 홀로1 
    "미나토 아쿠아": [
        "아쿠아", "아크아", "아쿠킨", "아티시", "아타시", "아틔시", "아타싀", "악취시", "냄틔시", "양파",
        "아쿠땅", "아쿠시오", "아쿠카나", "아쿠스이"
    ],
    "나키리 아야메": ["아야메", "오죠", "파코요"],
    "무라사키 시온": ["시온", "쿠소가키", "쿠소", "쿠로아", "아쿠시오"],
    "유즈키 초코": ["초코", "초쿄", "초쿄센세", "초코센세", "초코센", "쵸코", "쵸코센세", "쵸코센", "구타라"],
    "오오조라 스바루":
    ["스바루", "슈바슈바", "스바스바", "오리", "스바우", "오하스바", "바부미", "코바야시", "스바로"],  # 홀로 2
    "오오카미 미오": ["미오샤", "미오", "미옹", "후부미오"],
    "이누가미 코로네": [
        "코로네", "코로상", "코오네", "오카코로", "미코로네", "코로이모", "개이모", "개누나", "개 누나",
        "개 이모"
    ],
    "네코마타 오카유": ["오카유", "오카코로"],  # 홀로게임
    "호쇼 마린": [
        "마린선장", "마린", "센쵸", "센초", "선장", "키미타치", "키미땃쥐", "호쇼", "페코마린", "페코마리",
        "땃쥐맘", "마리루시", "마리후레"
    ],
    "시라누이 후레아": ["후땅", "후레아", "시라누이", "마리후레", "흑인", "니거", "노에후레"],
    "우루하 루시아": ["루굴", "루시아", "캠굴", "미케네코", "마리루시"],
    "우사다 페코라": [
        "우사다", "페코라", "이토우", "우페", "페코", "빼꺼", "파코라", "미코페코", "페코미코", "토끼",
        "토끼년", "페코무나", "혐끼", "페코마리", "페코마린", "마시로"
    ],
    "시로가네 노엘": ["노엘", "단장", "카난", "누엘", "족장", "노에후레"],  # 홀로3
    "츠노마키 와타메": [
        "츠노마키", "와타메", "와타멜론", "watamelon", "양 이모", "양이모", "콘방도도도", "도도도",
        "역전우동", "츠노마키", "뭇쿤", "바카타레", "기리와타"
    ],
    "토코야미 토와": ["토와", "토와사마", "콘얍삐", "군와", "톼삼", "퇴삼", "퇴1삼", "나루미", "카나토와"],
    "아마네 카나타": [
        "카나타", "텐시", "카나땅", "카나스이", "가짜천사", "가짜", "pp텐시", "pp천사", "PP천사",
        "PP텐시", "가짜고릴라", "고릴라년", "짝귀", "진짜천사", "가짜가짜", "진짜진짜", "카나토와", "노조무",
        "거근천사", "아쿠카나"
    ],
    "키류 코코": ["코코", "회장", "크손"],
    "히메모리 루나": ["루나", "모루루나", "모루루", "응나", "응나이모", "응나 이모", "나노라"],  # 홀로 4
    "유키하나 라미": ["라미", "라미즙", "청소부", "아사라미", "와미", "네포라보"],
    "모모스즈 네네": ["네네", "네네치", "네넷치", "대폭주", "슈퍼네네치", "네팔대폭주", "네포라보"],
    "시시로 보탄": ["보탄", "노사연", "누사연", "시시롱", "암사자", "네포라보", "골드짐"],
    "마노 알로에": ["알로에"],
    "오마루 폴카": [
        "오마루", "오마룽", "폴카", "포루", "노부히메", "노부히메", "누부히메", "메가히메", "ぽ", "포루코요",
        "네포라보", '포우포우', '페넥', '포루카', '메가'
    ],  # 홀로 5
    "사카마타 클로에": ["범고래", "클로에", "사카마타", "야다야다", "청소부", "루이크로", "루이클로"],
    "타카네 루이": ["루이모", "루이", "키순이", "루이네", "새이모", "루이크로", "루이클로"],
    "카자마 이로하": ["고자루", "이로하", "카자마", "이로하스", "홀로하"],
    "라플라스 다크니스":
    ["야마다", "나카오카", "라플라스", "총수", "라프라스", "이로하스", "La+", "라플러스", "나카오카"],
    "하쿠이 코요리": ["코요리", "핑라미", "아사코요", "코요", "포루코요", "코요테", "교수님"],  # 홀로 6
    "사쿠라 미코":
    ["미코", "미꼬", "똥코", "똥꼬", "야겜좌", "도박좌", "미코페코", "페코미코", "미코로네", "미코멧"],
    "호시마치 스이세이":
    ["호시마치", "스이세이", "스이", "스이짱", "스이쨩", "카나스이", "미코멧", "파란아야메", "아쿠스이"],
    "AZKi": ["아즈키", "AZKi", "나유타"],
    "친구A": ["에이쨩", "에이짱", "A쨩", "A짱"],
    "하루사키 노도카": ["노도카"],
    "EnMa": ["엔마", "엠마"],
    "다이도 시노부": ["시노부"],
    "오메가알파": ["오메가"],
    "이즈츠": ["이즈츠"],  # 홀로 etc
    "모리 칼리오페": ["칼리오페", "사신", "타카모리", "데몬다이스", "칼리"],
    "타카나시 키아라": ["키아라", "치킨", "타카모리", "케키히메", "점장"],
    "니노마에 이나니스": [
        "문어", "문어눈나", "이나니스", "이나", "무너", "타코", "무노", "무누", "WAH", "띠뜌",
        "문어눈나", "희주", "띠뜌"
    ],
    "가울 구라": ["상어", "구라", "구라짱", "구라쨩", "사메", "센자와", "굼바"],
    "왓슨 아멜리아": ["왓슨", "왓슨상", "아멜리아", "탐정", "슨상", "아메", "버프슨", "스몰아메", "아메무메"],
    "IRyS": ["아이리스", "베이리스", "나미린", "뚝딱이", "고블린", "IRyS",
             "namirin"],  # 홀로 en 1
    "츠쿠모 사나": ["사나", "흑인", "깜둥이"],
    "세레스 파우나":
    ["파우나", "나무위키 여신", "나무위키여신", "녹라미", "녹색라미", "노루", "파우나", "에디", "비건",
     "퐈나"],  # 홀로 en 2
    "오로 크로니": [
        "크로니", "피아제", "시계", "시계누나", "시계눈나", "시계 눈나", "시계 누나", "도토부", "크로메이",
        "해삼", "전투해삼", "시계우흥", "태희"
    ],
    "나나시 무메이": ["우흥이", "무메이", "우흥", "크로메이", "부엉이", "아메무메", "시계우흥"],
    "하코즈 벨즈": [
        "하코스", "하코즈", "벨즈", "밸즈", "벨주석", "가카", "쥐", "생쥐", "땃1쥐", "땃쥐", "베이",
        "주석", "베이리스", "챤케", "챤캐", "찬케", "찬캐", "라따뚜이"
    ],
    "요키": ["요키"],
    "하나사키 미야비": ["미야비"],
    "카가미 키라": ["키라"],
    "카나데 이즈루": ["이즈루"],
    "아르란디스": ["아루란", "아루란디스", "아르란디스", "아르란"],
    "아스텔 레다": ["레다", "아스텔"],
    "키시도 텐마": ["텐마"],
    "유코쿠 로베루": ["로베루", "로벨"],
    "츠키시타 카오루": ["카오루"],
    "카게야마 시엔": ["시엔"],
    "아라가미 오가": ["오가"],
    "야토가미 후마": ["후마"],
    "우츠기 우유": ["우츠기", "우유"],
    "히자키 감마": ["감마"],
    "미나세 리오": ["리오"],
    "매그니 데즈몬드": ["매그니", "마그니", "란도"],
    "악셀 시리오스": ["악셀", "엑셀", "시리오스"],
    "누아르 베스퍼": ["누아르", "베스퍼", "버삼촌"],
    "리지스 알테어": ["알테아", "알테어", "한별이", "한별"],  # 홀로스타즈
    "쿠레이지 올리": ["올리", "좀비"],
    "무나 호시노바": ["무나", "페코무나"],
    "이오피": ["이오피", "인도라팡", "인니라팡", "이오피프틴"],
    "아윤다 리스": ["리스", "다람쥐", "아윤다", "리수"],
    "아냐 멜핏사": ["아냐", "멜핏사"],
    "파볼리아 레이네": ["레이네", "공작", "파볼리아"],
    "코보 카나에루": ["코보", "물통", "파도", "물그릇"],
    "베스티아 제타": ["제타", "인니우흥"],
    "카엘라 코발스키아": ["카엘라", "뗑컨", "펭귄", "코왈스키", "코발스키", "대장장이"],  # 홀로 인도네시아
}

youtube_channel_id = {
    "사쿠라 미코": "@SakuraMiko",
    "라플라스 다크니스": "@LaplusDarknesss",
    "하쿠이 코요리": "@HakuiKoyori",
    "아마네 카나타": "@AmaneKanata",
    "사카마타 클로에": "@SakamataChloe",
    "우사다 페코라": "@usadapekora",
    "호시마치 스이세이": "@HoshimachiSuisei",
    "카자마 이로하": "@kazamairoha",
    "IRyS": "@IRyS",
    "오오조라 스바루": "@OozoraSubaru",
    "카구라 메아": "@KaguraMea",
    "나즈나": "@-amemiyanazuna-vshojo317",
    "kson": "@ksonONAIR",
    "네코타 츠나": "@tsuna_nekota",
    "코코아": "@COCOADOMYOJI",
    "마이사키 베리": "@MaisakiBerry",
    "시구레 우이": "@ui_shig",
    "요시카": "@YOSHIKA-Ch",
    "츠키노 미토": "@TsukinoMito",
    "셀리나 아이즈펠트": "@EisfeldSelina",
}

exceptholo = {}
exceptholo.update(vtuber_origin)
exceptholo.update(nijisanji)
exceptholo.update(nijikr)

vtuber = {}
vtuber.update(vtuber_origin)
vtuber.update(nijisanji)
vtuber.update(nijikr)
vtuber.update(hololive)

nicknames = []
for name in vtuber:
    nicknames.extend(vtuber[name])
